In [1]:
import pandas as pd

In [2]:
# ✅ Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 22],
    'City': ['Delhi', 'Mumbai', 'Bangalore']
}
df = pd.DataFrame(data)

In [3]:
# ✅ Filtering & Conditions
df[df['Age'] > 25]
df[(df['Age'] > 25) & (df['City'] == 'Mumbai')]
df.query('Age > 25 and City == "Mumbai"')

  Name  Age    City
1  Bob   30  Mumbai

In [4]:
# ✅ Sorting
df.sort_values('Age', ascending=True)
df.sort_values(by=['City', 'Age'], ascending=[True, False])

      Name  Age       City
2  Charlie   22  Bangalore
0    Alice   25      Delhi
1      Bob   30     Mumbai


Explanation:
When you try to perform aggregation operations on columns, all the specified columns must exist in the DataFrame. In this case, 'Salary' is not a column in your DataFrame, causing the KeyError.

Would you like me to provide the corrected code?

In [9]:
# Assistant
# ✅ GroupBy and Aggregation
df.groupby('City')['Age'].mean()

# Option 1: If you want to use only existing columns
df.groupby(['City', 'Name']).agg({'Age': 'max'})

# Option 2: If you need to rename 'Salary' to an existing column (e.g., 'Income')
# df.groupby(['City', 'Name']).agg({'Age': 'max', 'Income': 'sum'})

# Option 3: If you need to add the Salary column first
# df['Salary'] = [value1, value2, ...] # Add appropriate values
# df.groupby(['City', 'Name']).agg({'Age': 'max', 'Salary': 'sum'})

                   Age
City      Name
Bangalore Charlie   22
Delhi     Alice     25
Mumbai    Bob       30

In [10]:
# ✅ Pivot Tables
df.pivot_table(index='City', columns='Name', values='Age', aggfunc='sum')

Name       Alice   Bob  Charlie
City
Bangalore    NaN   NaN     22.0
Delhi       25.0   NaN      NaN
Mumbai       NaN  30.0      NaN

In [13]:
# ✅ Handling Missing Data
df.isnull().sum()
df.dropna()
df.fillna(0)
df.ffill()
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [14]:
# ✅ Type Conversion
df['Age'] = df['Age'].astype(float)